def solution(n):
    cnt = 1
    # 순간이동은 건전지 사용량 줄지 않음.
    # k 칸 점프하면 k만큼 건전지 줄어듬
    # 아이언슈트를 착용하고 이동할때는 순간이동
    # 건전지 사용량 최소값
    # 현재까지 온 거리 x 2 위치로 순간이동
    
    '''
    n = 6
    1칸 점프 -> 1
    순간이동 -> 2
    1칸 점프 -> 3
    순간이동 -> 6
    
    5 나눌수없으니 -1 = 4
    4 나눌 수 있으니 /2 = 2
    2 나눌 수 있으니 /2 = 1
    
    5000 나눌 수 있으니 /2 = 2500
    2500 나눌 수 있으니 /2 = 1250
    1250 / 2 = 625
    625 -1 = 624
    624 / 2 = 312
    312 / 2 = 156
    156 / 2 = 78
    78 / 2 = 39
    39 - 1 = 38
    38 / 2 = 19
    19 - 1= 18
    18 / 2 = 9
    9 - 1 = 8
    8 / 2 = 4
    4 / 2 = 2
    2 / 2 = 1 => 1이면 return
    '''
    while n > 1:
        if n % 2 == 0:
            n //= 2
        else:
            n -= 1
            cnt += 1
    return cnt